/**
 * 食材エナジー表
 * @type {number}
 */
const foodEnergyMap = {
  "ふといながねぎ": 185,
  "あじわいキノコ": 167,
  "とくせんエッグ": 115,
  "ほっこりポテト": 124,
  "とくせんリンゴ": 90,
  "げきからハーブ": 130,
  "マメミート": 103,
  "モーモーミルク": 98,
  "あまいミツ": 101,
  "ピュアなオイル": 121,
  "あったかジンジャー": 109,
  "あんみんトマト": 110,
  "リラックスカカオ": 151,
  "おいしいシッポ": 342,
  "ワカクサ大豆": 100,
  "ワカクサコーン": 140,
  "めざましコーヒー": 153
};

/**
 * 食材カラー表
 */
const foodColorMap = {
  "ふといながねぎ": '#37A56B',
  "あじわいキノコ": '#B27054',
  "とくせんエッグ": '#FCFAF0',
  "ほっこりポテト": '#F4BF7A',
  "とくせんリンゴ": '#EF3930',
  "げきからハーブ": '#E84B4B',
  "マメミート": '#EA9E6A',
  "モーモーミルク": '#4C6DC1', // white:#FCFCFC blue:#4C6DC1
  "あまいミツ": '#FAC801',
  "ピュアなオイル": '#E5DF6C',
  "あったかジンジャー": '#FCC56B',
  "あんみんトマト": '#ED4F4F',
  "リラックスカカオ": '#E0945C',
  "おいしいシッポ": '#F2BBC4',
  "ワカクサ大豆": '#F9D79B',
  "ワカクサコーン": '#FFE36C',
  "めざましコーヒー": '#A37D55'
};